EDT/УТ/src/Catalogs/Кассиры/Кассиры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Кассиры</name>
  <attributes>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/InformationRegisters/НазначениеКассировПоОрганизациям/НазначениеКассировПоОрганизациям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НазначениеКассировПоОрганизациям</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>УчитываетсяПриНазначении</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>График</name>
    <type>
      <types>CatalogRef.ГрафикиРаботыКассиров</types>
    </type>
  </resources>
  <resources>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Кассир</name>
    <type>
      <types>CatalogRef.Кассиры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Catalogs/Кассиры/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	//чтение данных РС НазначениеКассировПоОрганизациям
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	НазначениеКассировПоОрганизациямСрезПоследних.Период КАК Период,
	                      |	НазначениеКассировПоОрганизациямСрезПоследних.Кассир КАК Кассир,
	                      |	НазначениеКассировПоОрганизациямСрезПоследних.Организация КАК Организация,
	                      |	НазначениеКассировПоОрганизациямСрезПоследних.УчитываетсяПриНазначении КАК УчитываетсяПриНазначении,
	                      |	НазначениеКассировПоОрганизациямСрезПоследних.График КАК График,
	                      |	ЕСТЬNULL(НазначениеКассировПоОрганизациямСрезПоследних.Порядок, 0) КАК Порядок,
	                      |	НазначениеКассировПоОрганизациямСрезПоследних.Терминал КАК Терминал
	                      |ИЗ
	                      |	РегистрСведений.НазначениеКассировПоОрганизациям.СрезПоследних КАК НазначениеКассировПоОрганизациямСрезПоследних
	                      |ГДЕ
	                      |	НазначениеКассировПоОрганизациямСрезПоследних.Кассир = &Кассир");
	Запрос.УстановитьПараметр("Кассир", ТекущийОбъект.Ссылка);
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда		
		УчитываетсяПриНазначении = Рез.УчитываетсяПриНазначении;
		Организация              = Рез.Организация;
		График                   = Рез.График;
		Порядок                  = Рез.Порядок;
		Терминал                 = рез.Терминал;
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ФизЛицоПриИзменении(Элемент)
	
	объект.Наименование = Объект.ФизЛицо.Наименование;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// запись данных в РС НазначениеКассировПоОрганизациям
	ТекВр = ТекущаяДата();
	
	Набор = РегистрыСведений.НазначениеКассировПоОрганизациям.СоздатьНаборЗаписей();
	Набор.Отбор.Кассир.Установить(ТекущийОбъект.Ссылка);
	Набор.Отбор.Период.Установить(ТекВр);
	Набор.Прочитать();
	
	НЗапись = Набор.Добавить();
	НЗапись.График = График;
	НЗапись.Кассир = ТекущийОбъект.Ссылка;
	НЗапись.Период = ТекВр;
	НЗапись.Порядок = Порядок;
	НЗапись.Организация = Организация;
	НЗапись.Терминал = Терминал;
	НЗапись.УчитываетсяПриНазначении = УчитываетсяПриНазначении;
	
	Набор.Записать();	
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Порядок = 0 Тогда
	
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	МАКСИМУМ(ЕСТЬNULL(НазначениеКассировПоОрганизациям.Порядок, 0)) КАК Порядок
		                      |ИЗ
		                      |	РегистрСведений.НазначениеКассировПоОрганизациям КАК НазначениеКассировПоОрганизациям");
		Рез = Запрос.Выполнить().Выбрать();			
		Если Рез.Следующий() Тогда
			Если Рез.Порядок = NULL Тогда		
				Порядок = 1;	
			Иначе
				Порядок = Число(Рез.Порядок) + 1;	
			КонецЕсли;					
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
